//#include "ADS112C04_i2c.h"

///*
//*********************************************************************************************************
//*	函 数 名: i2c_Delay
//*	功能说明: I2C总线位延迟，最快400KHz
//*	形    参：无
//*	返 回 值: 无
//*********************************************************************************************************
//*/
//static void ADS112C04_i2c_Delay(void)
//{
//	uint8_t i;

//	/*　
//	 	下面的时间是通过逻辑分析仪测试得到的。
//    工作条件：CPU主频72MHz ，MDK编译环境，1级优化
//  
//		循环次数为10时，SCL频率 = 205KHz 
//		循环次数为7时，SCL频率 = 347KHz， SCL高电平时间1.5us，SCL低电平时间2.87us 
//	 	循环次数为5时，SCL频率 = 421KHz， SCL高电平时间1.25us，SCL低电平时间2.375us 
//	*/
//	for (i = 0; i < 120; i++);
//}

///*
//*********************************************************************************************************
//*	函 数 名: i2c_Start
//*	功能说明: CPU发起I2C总线启动信号
//*	形    参：无
//*	返 回 值: 无
//*********************************************************************************************************
//*/
//void ADS112C04_i2c_Start(void)
//{
//	/* 当SCL高电平时，SDA出现一个下跳沿表示I2C总线启动信号 */
//  I2C_SDA_High;
//	I2C_SCL_High;
//	ADS112C04_i2c_Delay();
//	I2C_SDA_Low;
//	ADS112C04_i2c_Delay();
//	I2C_SCL_Low;
//	ADS112C04_i2c_Delay();
//}

///*
//*********************************************************************************************************
//*	函 数 名: i2c_Start
//*	功能说明: CPU发起I2C总线停止信号
//*	形    参：无
//*	返 回 值: 无
//*********************************************************************************************************
//*/
//void ADS112C04_i2c_Stop(void)
//{
//	/* 当SCL高电平时，SDA出现一个上跳沿表示I2C总线停止信号 */
//	I2C_SDA_Low;
//	I2C_SCL_High;
//	ADS112C04_i2c_Delay();
//	I2C_SDA_High;
//}

///*
//*********************************************************************************************************
//*	函 数 名: i2c_SendByte
//*	功能说明: CPU向I2C总线设备发送8bit数据
//*	形    参：_ucByte ： 等待发送的字节
//*	返 回 值: 无
//*********************************************************************************************************
//*/
//void ADS112C04_i2c_SendByte(uint8_t _ucByte)
//{
//	uint8_t i;

//	/* 先发送字节的高位bit7 */
//	for (i = 0; i < 8; i++)
//	{		
//		if (_ucByte & 0x80)
//		{
//			I2C_SDA_High;
//		}
//		else
//		{
//			I2C_SDA_Low;
//		}
//		ADS112C04_i2c_Delay();
//		I2C_SCL_High;
//		ADS112C04_i2c_Delay();	
//		I2C_SCL_Low;
//		_ucByte <<= 1;	/* 左移一个bit */
//		ADS112C04_i2c_Delay();
//	}
//}

///*
//*********************************************************************************************************
//*	函 数 名: i2c_ReadByte
//*	功能说明: CPU从I2C总线设备读取8bit数据
//*	形    参：无
//*	返 回 值: 读到的数据
//*********************************************************************************************************
//*/
//uint8_t ADS112C04_i2c_ReadByte(void)
//{
//	uint8_t i;
//	uint8_t value;

//	GPIODirModeSet(GPIO_PORT_SDA, I2C_SDA_PIN, GPIO_DIR_MODE_IN);
//	
//	/* 读到第1个bit为数据的bit7 */
//	value = 0;
//	for (i = 0; i < 8; i++)
//	{
//		value <<= 1;
//		I2C_SCL_High;
//		ADS112C04_i2c_Delay();
//		if (I2C_SDA_READ)
//		{
//			value++;
//		}
//		I2C_SCL_Low;
//		ADS112C04_i2c_Delay();
//	}
//	
//	GPIODirModeSet(GPIO_PORT_SDA, I2C_SDA_PIN, GPIO_DIR_MODE_OUT);
//	
//	return value;
//}

///*
//*********************************************************************************************************
//*	函 数 名: i2c_WaitAck
//*	功能说明: CPU产生一个时钟，并读取器件的ACK应答信号
//*	形    参：无
//*	返 回 值: 返回0表示正确应答，1表示无器件响应
//*********************************************************************************************************
//*/
//uint8_t ADS112C04_i2c_WaitAck(void)
//{
//	uint8_t re;

//	I2C_SDA_High;	/* CPU释放SDA总线 */
//	
//	GPIODirModeSet(GPIO_PORT_SDA, I2C_SDA_PIN, GPIO_DIR_MODE_IN);
//	
//	ADS112C04_i2c_Delay();
//	I2C_SCL_High;	/* CPU驱动SCL = 1, 此时器件会返回ACK应答 */
//	ADS112C04_i2c_Delay();
//	if (I2C_SDA_READ)	/* CPU读取SDA口线状态 */
//	{
//		re = 1;
//	}
//	else
//	{
//		re = 0;
//	}
//	I2C_SCL_Low;
//	ADS112C04_i2c_Delay();
//	
//	GPIODirModeSet(GPIO_PORT_SDA, I2C_SDA_PIN, GPIO_DIR_MODE_OUT);
//	
//	return re;
//}

///*
//*********************************************************************************************************
//*	函 数 名: i2c_Ack
//*	功能说明: CPU产生一个ACK信号
//*	形    参：无
//*	返 回 值: 无
//*********************************************************************************************************
//*/
//void ADS112C04_i2c_Ack(void)
//{
//	I2C_SDA_Low;	/* CPU驱动SDA = 0 */
//	ADS112C04_i2c_Delay();
//	I2C_SCL_High;	/* CPU产生1个时钟 */
//	ADS112C04_i2c_Delay();
//	I2C_SCL_Low;
//	ADS112C04_i2c_Delay();
//	I2C_SDA_High;	/* CPU释放SDA总线 */
//}

///*
//*********************************************************************************************************
//*	函 数 名: i2c_NAck
//*	功能说明: CPU产生1个NACK信号
//*	形    参：无
//*	返 回 值: 无
//*********************************************************************************************************
//*/
//void ADS112C04_i2c_NAck(void)
//{
//	I2C_SDA_High;	/* CPU驱动SDA = 1 */
//	ADS112C04_i2c_Delay();
//	I2C_SCL_High;	/* CPU产生1个时钟 */
//	ADS112C04_i2c_Delay();
//	I2C_SCL_Low;
//	ADS112C04_i2c_Delay();	
//}















