//-----------------------------------------------------------------
// 程序描述: 串口函数
//		在Keil uVision4开发平台下基于STM32的程序模板
// 作    者: 凌智电子
// 开始日期: 2018-04-09
// 完成日期: 2014-04-24
// 修改日期:
// 版    本: V1.0
//   - V1.0: 初步模板
// 调试工具: 凌智STM32+FPGA电子系统设计开发板、LZE_ST LINK2、2.8寸液晶屏
// 说    明:
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include <stm32f10x.h>
#include "Delay.h"
#include "AD9226.h"


//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------



//-----------------------------------------------------------------
// void PeripheralInit(void)
//-----------------------------------------------------------------
// 
// 函数功能: 外设初始化函数
// 入口参数: 无 
// 返 回 值: 无
// 全局变量: 无
// 调用模块: 无
// 注意事项: 无
//-----------------------------------------------------------------

union date
{
	uint16_t read;
	uint8_t temp[2];
};
uint16_t AD9226_GetAdc()
{
	union date Adc;
	CLK_L;
	Delay_1us(1);
	CLK_H;
	Delay_ns(5);
	Adc.temp[0] = (uint8_t) ((GPIOE->IDR)&0xbf); 
	Adc.temp[1] = (uint8_t) ((GPIOB->IDR)&0xf4); 

// 	temp = GPIOC->IDR;
// 	temp = temp & 0xfff0;
// 	temp = temp >> 4;
	return(Adc.read);
}

// 	u16 temp;
// // 	u8 date_11, date_10, date_9, 
// // 	   date_8, date_7, date_6,
// // 		 date_5, date_4, date_3,
// // 	   date_2, date_1, date_0;
// 	temp=0;
// // 	date_11=date_10=date_9=0;
// // 	date_8=date_7=date_6=0;
// //   date_5=date_4=date_3=0;
// //   date_2=date_1=date_0=0;
// // 	CLK_H;
// 	D11_H;   D10_H;   D6_H;         
// 	D5_H;    D4_H;    D3_H;         
// 	D2_H;    D1_H;    D0_H;         
// 	CLK_L;
// 	Delay_1us(1);
// 	CLK_H;
// 	{
// 		Delay_ns(50);
// 		if(D0_IS_H)
// 		{
// 			temp = 0x0001;		
// 		}
// 		temp = temp << 1;
// 		if(D1_IS_H)
// 		{
// 			temp = temp + 0x0001;
// 		}
// 			temp = temp << 1;
// 		if(D2_IS_H)
// 		{
// 			temp = 0x0001;		
// 		}
// 		temp = temp << 1;
// 		if(D3_IS_H)
// 		{
// 			temp = 0x0001;		
// 		}
// 		temp = temp << 1;
// 		if(D4_IS_H)
// 		{
// 			temp = 0x0001;		
// 		}
// 		temp = temp << 1;
// 		if(D5_IS_H)
// 		{
// 			temp = 0x0001;		
// 		}
// 		temp = temp << 1;
// 		if(D6_IS_H)
// 		{
// 			temp = 0x0001;		
// 		}
// 		temp = temp << 1;
// 		if(D7_IS_H)
// 		{
// 			temp = 0x0001;		
// 		}
// 		temp = temp << 1;
// 		if(D8_IS_H)
// 		{
// 			temp = 0x0001;		
// 		}
// 		temp = temp << 1;
// 		if(D9_IS_H)
// 		{
// 			temp = 0x0001;		
// 		}
// 		temp = temp << 1;
// 		if(D10_IS_H)
// 		{
// 			temp = 0x0001;		
// 		}
// 		temp = temp << 1;
// 		if(D11_IS_H)
// 		{
// 			temp = 0x0001;		
// 		}
// 	}

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
