//-------------------------------------------------------------------------------------------------------------------
//程序描述：MAX262驱动代码
//
// 作   者：凌智电子
#include <reg52.h>
#include<max262.h>
#include<delay.h>
#include<math.h>
//---------------------------------------
//功能程序区
//--------------------------------------


//--------------------------------------
//uchar Fn(float f)
//--------------------------------------
//函数功能：计算Fn
//入口参数：f
//返回值： 控制字Fn
//全局变量：无
//注意事项：无
//--------------------------------------
uchar Fn(float f)  //频率关键字
{
    uchar temp;
    temp=(fclk*637/f)-26; //原本是*2/pi;即*0.637  fclk用M单位，f单位khz
    return temp;  	   //具体上芯片手册上的公式
}
//--------------------------------------
//uchar Qn(float q)
//--------------------------------------
//函数功能：计算Q的控制字n
//入口参数：q
//返回值： 控制字N
//全局变量：无
//注意事项：无
//--------------------------------------
uchar Qn(float q)  //品质因数关键字
{
    uchar temp;
    temp=128-(64/q);  //具体看芯片手册上有公式
    return temp; 
}

//--------------------------------------------
// void Filter1(uchar way,float f,float q)
//--------------------------------------------
//函数功能：滤波器1的模式、频率以及Q值的设置
//入口参数：模式way，截止/中心 频率f， Q值q
//返回值： 无
//全局变量：无
//注意事项：无
//--------------------------------------
void Filter1(uchar way,float f,float q)	 // way=
{					    //因为max262芯片里面是有两个二阶滤波器AB
	uchar i =0 ;		//这里是以filter A
	uchar j =0 ;
	uchar n =0;
	uchar nn=0;
	uchar sf=0;
	uchar sq=0;
	sf=Fn(f);	  //频率字
	sq=Qn(q);	  //Q值为品质因数控制字
	
	P1_7=1; 	  // 74hc373锁存使能开

	WrMax262=1;  //写入端为高电平
	delayms(100);

	P0_0=0;	 //a0~a3置为0，地址从0开始
	P0_1=0;
	P0_2=0;
	P0_3=0;
 
	WrMax262=0;	             //写入端置为低电平，开始进行数据写入
	delayms(100);	           //具体看芯片手册的的时序图
 
	P0_4=way&0x01;           // 0001取右边第一位的数据位, 放入P0_4
	P0_5=way&0x02;           // 0010取右边第二位的数据位, 放入P0_5
	
	delayms(100);
	WrMax262=1;	             //写入端置为高电平, 数据写入停止
	delayms(100);
					  
	for(i=1;i<4;i++)         //循环3次;主要是对频率控制字进行设置
	{					                 //这里以第一次"i=1"为例
		uchar b=0;
		uchar a =0;
					                   //max262地址排序为A3 A2 A1 A0
		a= pow(2,n);             // 2的n次方；a=0001
		P0_0=i&0x01;             // A0 =0001&0001=1
		P0_1=i&0x02;             // A1 =0001&0010=0
		P0_2=i&0x04;             // A2 =0001&0100=0
		P0_3=0;	                 // A3, filterA地址中A3为0，具体看芯片手册
					                   // 所以在i=1时，地址为A3 A2 A1 A0=0001
		delayms(100);
		WrMax262=0;	             //写入端置低电平，开始写入数据操作
		delayms(100);
		
		P0_4=sf & (a&0xff);	     // sf & a
		n++;	  			           //每次循环n++
		b=pow(2,n);			     //	b=2的n次方，b=4=0100
		P0_5=sf & (b&0xff);	   //sf & 0100
		delayms(100);
		WrMax262=1;			         //写入端置高电平，停止数据写入
		delayms(100);
		n++;				             //n++
  }
	
	for(j=4;j<7;j++)	 //这个循环主要以品质因数控制字进行控制
	{						       //具体看芯片手册上的详细介绍
		uchar bb =0;
		uchar aa =0;	   //这里还是以第一次循环为例，后面的循环要自己算上去
		aa= pow(2,nn);	 //aa=2的0次方，1=0001 ,还是先设置地址参数
						         //J以4为开始位

		P0_0=j&0x01;	 //	A0= j&0001
		P0_1=j&0x02;	 //	A1= j&0010
		P0_2=j&0x04;	 //	A2= J&0100
		P0_3=0;			   //	A3=0
						       //地址为A0 A1 A2 A3
    delayms(100);		
    WrMax262=0;			   //写入端置为低电平，开始数据写入
		delayms(100);
		
    P0_4=sq&(aa&0xff);	   //D0=sq&aa
		nn++;	
    bb = pow(2,nn);
	  P0_5=sq&(bb&0xff);     //D1=sq&bb	
		
		delayms(100);
		WrMax262=1;			   //写入端置为高电平，数据写入停止
		delayms(100);
		nn++;		
	}
	
	P0_0=7&0x01;   //A0=0111 & 	0001=1
	P0_1=7&0x02;   //A1=0111 & 	0010=1
	P0_2=7&0x04;   //A2=0111 & 	0100=1
	P0_3=0;		     //A3=0
								 //地址A3 A2 A1 A0=0111;
	delayms(100);
	WrMax262=0;		 //写入端置为低电平，开始数据写入
	delayms(100);

	P0_4=sq&0x40;		// D0=sq & 0100
	
	delayms(100);
	WrMax262=1;		//写入端置为高电平，数据写入停止
	delayms(100);

	P1_7=0;		  //锁存器74hc373使能端置低电平，
}

//--------------------------------------------
// void Filter2(uchar way,float f,float q)
//--------------------------------------------
//函数功能：滤波器2的模式、频率以及Q值的设置
//入口参数：模式way，截止/中心 频率f， Q值q
//返回值： 无
//全局变量：无
//注意事项：无           
//--------------------------------------------
void Filter2(uchar way,float f,float q)  //与上面 void Filter1 的一样的 
{
	uchar i =0 ;
	uchar j =0 ;
	uchar n =0;
	uchar nn=0;
	uchar sf=0;
	uchar sq=0;
	sf=Fn(f);
	sq=Qn(q);
	
	P1_7=1;

	WrMax262=1; 
	delayms(100);

	P0_0=0;
	P0_1=0;
	P0_2=0;
	P0_3=1;
 
	WrMax262=0;
	delayms(100);
 
	P0_4=way&0x01;
	P0_5=way&0x02;
	
	delayms(100);
	WrMax262=1;
	delayms(100);
		
	for(i=1;i<4;i++)
	{		
		uchar b=0;
		uchar a =0;
		
		a= pow(2,n);
		P0_0=i&0x01;
		P0_1=i&0x02;
		P0_2=i&0x04;
		P0_3=1;
		
		delayms(100);
		WrMax262=0;
		delayms(100);
		
		P0_4=sf & (a&0xff);
		n++;	
    b	= pow(2,n);
	  P0_5=sf & (b&0xff);
		delayms(100);
		WrMax262=1;
		delayms(100);
		n++;
  }
	
	for(j=4;j<7;j++)
	{	
		uchar bb =0;
		uchar aa =0;
		aa= pow(2,nn);
    P0_0=j&0x01;
		P0_1=j&0x02;
		P0_2=j&0x04;
		P0_3=1;	
		
    delayms(100);		
    WrMax262=0;	
		delayms(100);
		
    P0_4=sq&(aa&0xff);
		nn++;	
    bb = pow(2,nn);
	  P0_5=sq&(bb&0xff);	
		
		delayms(100);
    WrMax262=1;
		delayms(100);
		nn++;		
	}
	
	P0_0=7&0x01;
	P0_1=7&0x02;
	P0_2=7&0x04;
	P0_3=1;

	delayms(100);
	WrMax262=0;
	delayms(100);

	P0_4=sq&0x40;
	
	delayms(100);
	WrMax262=1;
	delayms(100);

	P1_7=0;
}