//-----------------------------------------------------
// MAX262程序头文件
//有文件名：max262.h
//作  者：凌智电子
//编写时间：2014-01-28
//修改日期：
//-----------------------------------------------------




#ifndef _MAX262_H
#define _MAX262_H

//-----------------------------------------------------
//宏定义
//-----------------------------------------------------

#define uchar unsigned char
#define uint  unsigned int
#define fclk   0.1398   //即139.8khz //2Mhz 即2000khz，和后面0.637恰好抵消小数部分
sbit WrMax262=P1^0;    //MAX262写入端
sbit P0_0=P0^0;
sbit P0_1=P0^1;
sbit P0_2=P0^2;
sbit P0_3=P0^3;
sbit P0_4=P0^4;
sbit P0_5=P0^5;
sbit P1_7=P1^7;    // 锁存器的使能端

//-----------------------------------------------------
//外部函数声明
//-----------------------------------------------------
uchar Fn(float f);
uchar Qn(float q);
void Filter1(uchar way,float f,float q);
void Filter2(uchar way,float f,float q);



#endif
//-----------------------------------------------------
//end of file
//-----------------------------------------------------