/* Introduce ----------------------------------------- *
	VET6初始化代码
	包含DSP库
	可用延时操作
 ----------------------------------------------------- */
/* Include ------------------------------------------- */
#include "stm32f4xx.h"
#include "usart.h"
#include "delay.h"
/* User Temp Include --------------------------------- */
#include "LED.h"//PC0 为VET6 LED
/* LWX BSP Driver Lib -------------------------------- */
#include "DSP_LWX_FFT.h"
/* User Define --------------------------------------- */
/* User Variable ------------------------------------- */
/* User Extern --------------------------------------- */
/* User Function ------------------------------------- */
/* Main ---------------------------------------------- */
int main(void)
{
	delay_init(168);
	uart_init(115200);
	LED_Init();
  while(1)
	{
	
	}
}




